[
  {
    "id": 1,
    "title": "React UI Component Library",
    "type": "Library",
    "stack": ["React", "TypeScript", "Storybook", "Tailwindcss"],
    "description": "Reusable React UI component library with a custom design system and full Storybook documentation.",
    "longDescription": "This is a reusable UI component library built with React and TypeScript. It includes a full design system and is documented using Storybook, making it easy to scale and maintain across multiple projects. Components are styled with TailwindCSS for responsiveness and consistency. It helps teams build faster by offering pre-built, accessible, and customizable UI blocks.",
    "code": "https://github.com/your-username/react-ui-library",
    "deploy": "https://react-ui-library-demo.vercel.app",
    "image": "https://storybook.js.org/docs-assets/8.6/get-started/example-onboarding-wizard.png",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Doc"
  },
  {
    "id": 2,
    "title": "React Hooks Utility Library",
    "type": "Library",
    "stack": ["React", "TypeScript", "Jest"],
    "description": "A set of custom React hooks to simplify state handling, local storage, data fetching, and more.",
    "longDescription": "This utility library provides a collection of reusable React hooks developed in TypeScript. It includes useful hooks for working with localStorage, media queries, breakpoints, async data fetching, and more. The library is designed for performance and testability, using Jest for unit testing. It helps developers reduce boilerplate code and build React apps more efficiently.",
    "code": "https://github.com/your-username/react-hooks-library",
    "deploy": "https://www.npmjs.com/package/react-hooks-library",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/k414voypcrwjgxyog3p7",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Doc"
  },
  {
    "id": 3,
    "title": "Helpers Kit Utility Library",
    "type": "Library",
    "stack": ["TypeScript", "Vitest"],
    "description": "Framework-agnostic TypeScript helper functions like deepClone, debounce, slugify, and more.",
    "longDescription": "A utility library built entirely in TypeScript, designed to be framework-agnostic. It includes helper functions commonly used in both frontend and backend development, such as deep cloning, debouncing, string manipulation (slugify), and more. Ideal for use in any TypeScript project that needs reliable, well-typed utilities.",
    "code": "https://github.com/your-username/ts-helpers-kit",
    "deploy": "https://www.npmjs.com/package/ts-helpers-kit",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/zj8mhsdhisazspztrkk3",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Doc"
  },
  {
    "id": 4,
    "title": "The Coffee Roastery",
    "type": "Project",
    "stack": [
      "React",
      "Firebase",
      "Tailwindcss",
      "ReactRouter",
      "Framer Motion"
    ],
    "description": "A coffee shop website focused on clean UI and visual storytelling. Built with React and Firebase.",
    "longDescription": "I designed and developed a website for a coffee brand with a minimal and elegant approach. The site aims to convey warmth and quality through high-resolution imagery and a clean user interface. Built using React and Tailwindcss for responsive and fast development, it integrates Firebase for content management and user authentication. Smooth animations powered by Framer Motion enhance user experience. The natural color palette emphasizes the earthy tones of freshly roasted coffee, evoking a handcrafted, premium feel.",
    "code": "https://github.com/emanuelpps/the-coffee-roastery",
    "deploy": "https://the-coffee-roastery.vercel.app/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/mpuxljlcp2k8iwdwotcx",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Deploy"
  },
  {
    "id": 5,
    "title": "The CodeMaker Lab",
    "type": "Project",
    "stack": [
      "Next.js",
      "TypeScript",
      "Tailwindcss",
      "Zustand",
      "Framer Motion"
    ],
    "description": "Redesign and development of a software agency website using modern technologies and animations.",
    "longDescription": "I was in charge of the complete redesign and development of The CodeMaker Lab's website, a software development agency. The original site had an outdated and unattractive look. I proposed a full visual overhaul, focusing on delivering a modern and professional experience. The site was built with Next.js and TypeScript, using Tailwindcss for styling, Zustand for global state management, and Framer Motion for smooth, engaging animations. The new design features bold typography, a vibrant and modern color palette, and intuitive navigation. The result is a visually impactful, user-friendly website aligned with the brand’s identity and goals.",
    "code": "",
    "deploy": "https://codemakerlab.vercel.app/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/jm2b7e48wpfisjdloapk",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Deploy"
  },
  {
    "id": 6,
    "title": "Actor Portfolio",
    "type": "Project",
    "stack": ["Next.js", "TypeScript", "Tailwindcss", "Framer Motion"],
    "description": "A personal website for an actor showcasing biography, performances, and photos.",
    "longDescription": "This portfolio website was developed for a theater actor as part of a project at The CodeMaker Lab. The site includes the actor’s biography, a list of past performances, and a gallery of stage photos. Built with Next.js and TypeScript for performance and scalability, the layout was designed with Tailwindcss for a modern and responsive experience. The visual structure is minimal yet bold, using large, elegant typography and a monochrome palette to convey a professional and artistic presence. The website’s goal is to clearly highlight the actor’s career while maintaining a stylish and personal presentation.",
    "code": "",
    "deploy": "https://mng-actor.vercel.app/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/hkhtxbhchexjiccmvetn",
    "gallery": [
      "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/uoavxaduhfas9v0mhh0d"
    ],
    "buttonText": "Deploy"
  },
  {
    "id": 7,
    "title": "Personal Portfolio 2024",
    "type": "Project",
    "stack": ["Next.js", "TypeScript", "Tailwindcss", "Framer Motion"],
    "description": "Mi portfolio anterior, desarrollado en 2023. Rediseñado anualmente para reflejar mi crecimiento profesional.",
    "longDescription": "Este fue mi portfolio personal durante 2024. Cada año desarrollo un nuevo portfolio con una estética y estructura renovadas, como ejercicio de mejora continua. Esta versión fue construida con Next.js, TailwindCSS y TypeScript, con un diseño centrado en la simplicidad, la legibilidad y una presentación clara de mis proyectos y experiencia.",
    "code": "https://github.com/emanuelpps/emanuelpps-portfolio",
    "deploy": "https://emanuelp-portfolio.vercel.app/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/ryhv6mnd6mwxnd6obmo6",
    "gallery": [],
    "buttonText": "Deploy"
  },
  {
    "id": 8,
    "title": "EP Weather App",
    "type": "Project",
    "stack": ["React Js", "JavaScript", "Fetch API", "Bootstrap", "CSS"],
    "description": "Aplicación del clima simple desarrollada en JavaScript puro con datos en tiempo real.",
    "longDescription": "Una aplicación web para consultar el clima actual de cualquier ciudad usando la API de OpenWeatherMap. Desarrollada como práctica de consumo de APIs con JavaScript puro, la interfaz es sencilla, responsive y muestra temperatura, condiciones climáticas y otros detalles útiles.",
    "code": "https://github.com/emanuelpps/EP-WeatherAPP",
    "deploy": "https://emanuelpps.github.io/EP-WeatherAPP/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/yuxe7vmfbx78qmownrjx",
    "gallery": [],
    "buttonText": "Deploy"
  },
  {
    "id": 9,
    "title": "Don Remolo Pizza",
    "type": "Project",
    "stack": [
      "React Js",
      "Firebase",
      "Framer Motion",
      "Bootstrap",
      "JavaScript",
      "CSS"
    ],
    "description": "Landing page ficticia para una pizzería, enfocada en diseño visual y experiencia de usuario.",
    "longDescription": "Don Remolo Pizza es una landing page diseñada para una marca ficticia de pizzería artesanal. El objetivo fue practicar diseño responsivo, organización de componentes, consumo de base de datos y experiencia visual animada para captar la atención del usuario.",
    "code": "https://github.com/emanuelpps/donremolo",
    "deploy": "https://donremolo.vercel.app/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/oyv76xau2xt9erpuh2lv",
    "gallery": [],
    "buttonText": "Deploy"
  },
  {
    "id": 10,
    "title": "Falcon Aviation Shop",
    "type": "Project",
    "stack": ["HTML", "CSS", "Vanilla JavaScript", "Bootstrap"],
    "description": "Ecommerce ficticio para una tienda de productos de aviación, desarrollado como práctica de maquetado.",
    "longDescription": "Falcon Aviation Shop es un sitio ecommerce ficticio creado como ejercicio de maquetado web. Diseñado con HTML, CSS y JavaScript, este proyecto incluye secciones de productos, carrito y navegación responsiva. Ideal para mostrar conocimientos básicos en estructuras de ecommerce visualmente atractivas.",
    "code": "https://github.com/emanuelpps/Falcon-Aviation-Shop",
    "deploy": "https://emanuelpps.github.io/Falcon-Aviation-Shop/",
    "image": "https://res.cloudinary.com/dkgoszhfr/image/upload/f_auto,q_auto/sv38khxiemhe8bg9i6q6",
    "gallery": [],
    "buttonText": "Deploy"
  }
]
